---
## Front matter
lang: ru-RU
title: Лабораторная работа №7
subtitle: Сетевые технологии
author:
  - Ищенко Ирина НПИбд-02-22
institute:
  - Российский университет дружбы народов, Москва, Россия

## i18n babel
babel-lang: russian
babel-otherlangs: english

## Formatting pdf
toc: false
toc-title: Содержание
slide_level: 2
aspectratio: 169
section-titles: true
theme: metropolis
header-includes:
 - \metroset{progressbar=frametitle,sectionpage=progressbar,numbering=fraction}
---

## Цель работы

Получение навыков настройки службы DHCP на сетевом оборудовании для распределения адресов IPv4 и IPv6.


# Выполнение лабораторной работы

##

![Топология моделируемой сети](image/1.png){#fig:1 width=70%}

##

![Настройка gw-01: изменение имени, домена, пользователя](image/2.png){#fig:2 width=70%}

##

![Настройка gw-01: удаление пользователя по умолчанию](image/3.png){#fig:3 width=70%}

##

![Настройка gw-01: IPv4-адресация и DHCP-сервер](image/4.png){#fig:4 width=70%}

##

![Настройка PC1 и проверка конфигурации](image/5.png){#fig:5 width=70%}

##

![Журнал работы](image/6.png){#fig:6 width=70%}

##

![Просмотр статистики DHCP, выданных адресов и журнала работы](image/7.png){#fig:7 width=70%}

##

![Проверка захваченных анализатором трафика пакетов](image/8.png){#fig:8 width=80%}

##

![Проверка захваченных анализатором трафика пакетов](image/9.png){#fig:9 width=80%}

##

![Топология дополненной сети](image/10.png){#fig:10 width=70%}

##

![Настройка gw-01: IPv6-адресация](image/11.png){#fig:11 width=70%}

##

![Настройка gw-01: DHCPv6 без отслеживания состояния](image/12.png){#fig:12 width=70%}

##

![Провера настроек сети на РС2, пинг маршрутизатора, проверка DNS](image/13.png){#fig:13 width=70%}

##

![Пинг маршрутизатора, проверка DNS](image/14.png){#fig:14 width=70%}

##

![Получение адреса на РС2, пинг маршрутизатора, проверка DNS](image/15.png){#fig:15 width=70%}

##

![Просмотр статистики DHCP, выданных адресов, пинг РС2](image/16.png){#fig:16 width=70%}

##

![Проверка захваченных анализатором трафика пакетов](image/17.png){#fig:17 width=70%}

##

![Проверка захваченных анализатором трафика пакетов](image/18.png){#fig:18 width=70%}

##

![Настройка gw-01: DHCPv6 с отслеживанием состояния](image/19.png){#fig:19 width=70%}

##

![Проверка настроек сети и DNS на РС3](image/20.png){#fig:20 width=70%}

##

![Проверка настроек сети и DNS на РС3](image/21.png){#fig:21 width=70%}

##

![Получение адреса на РС3](image/22.png){#fig:22 width=70%}

##

![Проверка настроек сети на РС3](image/23.png){#fig:23 width=70%}

##

![Проверка настроек сети на РС3](image/24.png){#fig:24 width=70%}

##

![Пинг маршрутизатора](image/25.png){#fig:25 width=70%}

##

![Просмотр статистики DHCP и выданных адресов](image/26.png){#fig:26 width=70%}

##

![Проверка захваченных анализатором трафика пакетов](image/27.png){#fig:27 width=70%}

## Выводы

В ходе выполнения лабораторной работы я получила навыки настройки службы DHCP на сетевом оборудовании для распределения адресов IPv4 и IPv6.

