---
## Front matter
lang: ru-RU
title: Лабораторная работа №1
subtitle: Сетевые технологии
author:
  - Ищенко Ирина НПИбд-02-22
institute:
  - Российский университет дружбы народов, Москва, Россия


## i18n babel
babel-lang: russian
babel-otherlangs: english

## Formatting pdf
toc: false
toc-title: Содержание
slide_level: 2
aspectratio: 169
section-titles: true
theme: metropolis
header-includes:
 - \metroset{progressbar=frametitle,sectionpage=progressbar,numbering=fraction}
---
# Цель работы

Изучение методов кодирования и модуляции сигналов с помощью высокоуровнего языка программирования Octave. Определение спектра и параметров сигнала. Демонстрация принципов модуляции сигнала на примере аналоговой амплитудной модуляции. Исследование свойства самосинхронизации сигнала.

# Выполнение лабораторной работы

## plot_sin.m

![Редактирование plot_sin.m](image/1.png){#fig:1 width=70%}

## plot_sin

![График функции](image/2.png){#fig:2 width=70%}

## plot_sin_cos.m

![Добавление линии на график](image/3.png){#fig:3 width=70%}

## meandr.m

![Графики меандра с разным количеством гармоник](image/4.png){#fig:4 width=70%}

## meandr.m синус

![Графики меандра с разным количеством гармоник через синусы](image/5.png){#fig:5 width=70%}

## Сигналы

![Два синусоидальных сигнала разной частоты](image/6.png){#fig:6 width=70%}

## Спектр

![ Спектр суммарного сигнала](image/7.png){#fig:7 width=70%}

## Амплитудная модуляция

![Спектр сигнала при амплитудной модуляции](image/8.png){#fig:8 width=70%}

## coding

![Создание и заполнение файлов в каталоге coding](image/9.png){#fig:9 width=70%}

## Сигналы

![Файлы с графиками кодированного сигнала](image/10.png){#fig:10 width=70%}

## Синхроназиция 

![Файлы с графиками, иллюстрирующими свойства самосинхронизации](image/12.png){#fig:11 width=70%}

## Спектры

![Файлы с графиками спектров сигналов](image/11.png){#fig:12 width=70%}

## Выводы

В ходе лабораторной работы я изучила методы кодирования и модуляции сигналов с помощью высокоуровнего языка программирования Octave, определение спектра и параметров сигнала. Произвела демонстрацию принципов модуляции сигнала на примере аналоговой амплитудной модуляции. Исследовала свойства самосинхронизации сигнала.